Revit 2027 API
ElectricalEquipment.IsSwitchboard Property
 The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSwitchboard { get; }
Public ReadOnly Property IsSwitchboard As Boolean
	Get
public:
property bool IsSwitchboard {
	bool get ();
}
member IsSwitchboard : bool with get
Property Value
Boolean
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace